WELCOME_MESSAGE_PRIVATE = '''👋 Добро пожаловать в бота Komaru!\n\nЗдесь вы можете собирать карточки комару и соревноватся с другими игроками.\nЧтобы начать получать карточки напиши "<code>Комару</code>"\nИспользуйте /help для получения дополнительной информации.\n\n➡️ Нажмите кнопку ниже, чтобы добавить бота в группу:'''

WELCOME_MESSAGE = '''👋 Komaru бот готов к работе!\n\nЗдесь вы можете собирать карточки комару и соревноватся с другими игроками.\nЧтобы начать получать карточки напиши "<code>Комару</code>"\n\nИспользуйте /help для получения информации о командах.'''

HELP_MESSAGE = (
    "<b>Komaru Bot</b> - Ваш помощник в сборе карточек комару\n\n"
    "<b>Доступные команды:</b>\n"
    "/start - Начать работу с ботом\n"
    "/help - Получить помощь\n"
    "'профиль', 'комару профиль', 'кпрофиль' - Посмотреть свой профиль\n"
    "'сменить ник &lt;ник&gt;' - Смена ника в профиле.\n"
    "'комару', 'получить карту', 'камар' - Искать котов и собирать карточки\n"
)

responses = [
    "Уберите лапки от чужой кнопки.",
    "Лапки вверх, вы арестованы!",
    "Ваши лапки не для этой кнопки.",
    "Лапки прочь от этой кнопки!",
    "Ваши лапки здесь лишние."
]

PREMIUM_TEXT = (f"🔓 Что даст тебе Комару премиум?\n\n"
                f"⌛️ Возможность получать карточки каждые 3 часа вместо 4\n"
                f"🃏 Повышенная вероятность выпадения легендарных и мифических карт\n"
                f"🌐 Возможность использовать смайлики в никнейме\n"
                f"💎 Отображение алмаза в топе карточек\n"
                f"🔄 Более быстрая обработка твоих сообщений\n"
                f"🗓️ Срок действия 30 дней\n\n")
